rails/majan/app/controllers/majanlogs_controller.rb

SELECT "majanlogs".* FROM "majanlogs"
---
  def index
    @majanlogs = Majanlog.all

INSERT INTO "majanlogs" ("num", "name1", "score1", "name2", "score2", "name3", "score3", "name4", "score4", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @majanlog = Majanlog.new(majanlog_params)

    respond_to do |format|
      if @majanlog.save

UPDATE "majanlogs" SET "score4" = ?, "updated_at" = ? WHERE "majanlogs"."id" = ?  [["score4", 500], ["updated_at", "2016-12-03 03:00:41.201296"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @majanlog.update(majanlog_params)

SELECT  "majanlogs".* FROM "majanlogs" WHERE "majanlogs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_majanlog
      @majanlog = Majanlog.find(params[:id])